Тестовая_база_ERP_14/src/Catalogs/ДополнительныеВнешниеКомпоненты/ДополнительныеВнешниеКомпоненты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополнительныеВнешниеКомпоненты</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеВК</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <comment>URL информационного файла</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/ДополнительныеВнешниеКомпоненты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИзФайла(Команда)
	
	#Если ВебКлиент Тогда
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеВыбораФайлаВКИзВеб", ЭтотОбъект);
		НачатьПомещениеФайла(ОписаниеОповещенияОЗавершении, , "*.zip", , УникальныйИдентификатор);
	#Иначе
		Режим = РежимДиалогаВыбораФайла.Открытие;
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		Фильтр = НСтр("ru = 'Файл внешней компоненты';
						|en = 'Add-in file'") + "(*.zip)|*.zip";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл внешней компоненты';
											|en = 'Select an add-in file'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайлаВКИзТонкогоКлиента", ЭтотОбъект);
		ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЧерезИнтернет(Команда)
	
	Результат = Неопределено;
	ОбновитьВнешнююКомпоненту(Объект.Идентификатор, УникальныйИдентификатор, Результат);
	
	Если Результат.Статус = "Выполняется" Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		Оповещение = Новый ОписаниеОповещения("ПослеОбновленияВнешнейКомпоненты", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, Оповещение, ПараметрыОжидания);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ВидОперации = НСтр("ru = 'Обновление внешней компоненты.';
							|en = 'Updating add-in.'");
		ДополнительныеВнешниеКомпонентыВызовСервера.ОбработатьОшибку(
			ВидОперации, Результат.ПодробноеПредставлениеОшибки, Результат.КраткоеПредставлениеОшибки);
		Прочитать();
	Иначе
		Прочитать();
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	ДополнительныеВнешниеКомпонентыКлиент.УдалитьВнешнююКомпонентуИзКэш(Объект.Идентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОбновленияВнешнейКомпоненты(Результат, ДополнительныеПараметры) Экспорт

	Прочитать();
	ОповеститьОбИзменении(Объект.Ссылка);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьВнешнююКомпоненту(Знач ИмяМодуля, Знач УникальныйИдентификатор, Результат)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление внешней компоненты.';
															|en = 'Updating add-in.'");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
		"Справочники.ДополнительныеВнешниеКомпоненты.ОбновитьВнешниеКомпоненты", Новый Структура(ИмяМодуля), ПараметрыВыполнения);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаВКИзВеб(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеВнешнейКомпоненты(Адрес);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеВнешнейКомпоненты(Адрес)
	
	ИнформацияОВК = ДополнительныеВнешниеКомпонентыВызовСервера.ИнформацияОВнешнейКомпоненте(Адрес);
	
	Если ИнформацияОВК = Неопределено Тогда
		Возврат;
	ИначеЕсли ИнформацияОВК.ИмяМодуля <> Объект.Идентификатор Тогда
		ТекстСообщения = НСтр("ru = 'Файл содержит данные другой внешней компоненты:  %1.
									|Необходимо указать файл внешней компоненты: %2.';
									|en = 'File contains data of another add-in: %1.
									|Specify an add-in file: %2.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИнформацияОВК.Название, Объект.Наименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СохранитьВнешнююКомпонентуВИнформационнойБазе(Адрес);
	
	ДополнительныеВнешниеКомпонентыКлиент.УдалитьВнешнююКомпонентуИзКэш(Объект.Идентификатор);
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаВКИзТонкогоКлиента(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено ИЛИ НЕ ВыбранныеФайлы.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, УникальныйИдентификатор);

	ОбновитьДанныеВнешнейКомпоненты(АдресФайла);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьВнешнююКомпонентуВИнформационнойБазе(Знач Адрес)
	
	Справочники.ДополнительныеВнешниеКомпоненты.СохранитьВнешнююКомпонентуВИнформационнойБазе(Адрес);
	
КонецПроцедуры

#КонецОбласти
